// ===== Журнал обновлений приложения =====
// Новые версии добавляйте В НАЧАЛО массива (сверху)
// Иконки: ✨ новое,  исправление,  оформление, 🚀 улучшение, 📱 адаптация

window.APP_CHANGELOG = [
    {
  version: "0.00.050",
  date: "23.10.2026",
  changes: [
    { icon: "⚡", text: "Добавлен полноценный справочник «Коды МКБ-10» в разделе «Шпаргалки»" },
    { icon: "⭐", text: "Добавлена ссылка в информационном окне для поддержки разработчика по системе ЕРИП («Чай-код» от Беларусбанка минимальная сумма для перевода 3 BYN максимальная 100 BYN)" },
    { icon: "💬", text: "Добавлена ссылка в информационном окне обратной связи в чат телеграм" }
  ]
  },
  {
  version: "0.00.043",
  date: "15.10.2026",
  changes: [
    { icon: "⚡", text: "Много мелких правок в калькуляторах" }
  ]
  }
];